---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalElementsInvalidAfterUpgrade
source: html/7fec823e-fabc-2201-dd5a-a92081027753.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalElementsInvalidAfterUpgrade Property

One or several analytical elements have become invalid during the upgrade process and will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalElementsInvalidAfterUpgrade { get; }
```